Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
/***************************************************************************//**
* File Name: cycfg_ble.c
* Version: 1.0
*
* Description:
* Bluetooth Low Energy (BLE) milddleware configuration.
* This file should not be modified. It was automatically generated by
* BLE Configurator 1.0.0 build 5150
*
********************************************************************************
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cycfg_ble.h"

#if (CY_BLE_CORE == CY_BLE_CORE_DUAL) || (CY_BLE_CORE == __CORTEX_M)

#include "cy_flash.h"
#include "cycfg_ble.h"
#include "cy_ble_common.h"

#if(CY_BLE_MODE_PROFILE)

/*******************************************************************************
*  BLE GAP CONFIGURATION
*******************************************************************************/

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
    /* The timeout value of slow advertising with slow advertising interval parameters */
    static cy_stc_ble_gapp_adv_params_t cy_ble_gappAdvConfig[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                             CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .fastAdvIntervalMin = 0x0020u, 
            .fastAdvIntervalMax = 0x0030u, 
            .fastAdvTimeOut = 0x1Eu, 
            .slowAdvEnable = 0x00u, 
            .slowAdvIntervalMin = 0x0640u, 
            .slowAdvIntervalMax = 0x4000u, 
            .slowAdvTimeOut = 0x96u, 
        },
    };

    /* Advertising parameters */
    cy_stc_ble_gapp_disc_param_t cy_ble_discoveryParam[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                       CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .advIntvMin = 0x0020u, 
            .advIntvMax = 0x0030u, 
            .advType = CY_BLE_GAPP_CONNECTABLE_UNDIRECTED_ADV, 
            .ownAddrType = 0x00u, 
            .directAddrType = 0x00u, 
            .directAddr = {0x00u, 0x00u, 0x00u, 0x50u, 0xA0u, 0x00u}, 
            .advChannelMap = 0x07u, 
            .advFilterPolicy = 0x00u, 
        },
    };

    /* Advertising data */
    cy_stc_ble_gapp_disc_data_t cy_ble_discoveryData[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                     CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .advData = { 0x02u, 0x01u, 0x05u, 0x0Fu, 0x09u, 0x46u,
                0x69u, 0x6Eu, 0x64u, 0x20u, 0x4Du, 0x65u,
                0x20u, 0x54u, 0x61u, 0x72u, 0x67u, 0x65u,
                0x74u, 0x05u, 0x03u, 0x02u, 0x18u, 0x0Au,
                0x18u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u }, 
            .advDataLen = 0x19u, 
        },
    };

    /* Scan response data */
    cy_stc_ble_gapp_scan_rsp_data_t cy_ble_scanRspData[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                       CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .scanRspData = { 0x0Fu, 0x09u, 0x46u, 0x69u, 0x6Eu, 0x64u,
                0x20u, 0x4Du, 0x65u, 0x20u, 0x54u, 0x61u,
                0x72u, 0x67u, 0x65u, 0x74u, 0x02u, 0x0Au,
                0x00u, 0x03u, 0x19u, 0x40u, 0x02u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u }, 
            .scanRspDataLen = 0x17u, 
        },
    };

    /* This array of type cy_stc_ble_gapp_disc_mode_info_t is present only when the
       BLE component is configured for Peripheral or Broadcaster GAP roles.
       It contains the Advertisement settings and also the Advertisement and
       Scan response data parameters entered in the customizer. This variable
       can be used by advanced users to change Advertisement settings,
       Advertisement or Scan response data in runtime.
    */
    cy_stc_ble_gapp_disc_mode_info_t cy_ble_discoveryModeInfo[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                              CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .discMode = 0x01u, 
            .advParam = &cy_ble_discoveryParam[0], 
            .advData = &cy_ble_discoveryData[0], 
            .scanRspData = &cy_ble_scanRspData[0], 
            .advTo = 0x1Eu, 
        },
    };
#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
    /* Initializes the cy_stc_ble_gapc_disc_info_t cy_ble_discoveryInfo structure */
    static cy_stc_ble_gapc_scan_params_t cy_ble_gapcScanConfig[CY_BLE_GAP_CENTRAL_COUNT +
                                                               CY_BLE_GAP_OBSERVER_COUNT] =
    {
        
    };

    /* This array of type cy_stc_ble_gapc_disc_info_t is present only when
       the BLE component is configured for Central or Observer GAP roles.
       It contains the Scan settings entered in the customizer.
       This variable can be used by advanced users to change Scan
       settings in runtime.
    */
    cy_stc_ble_gapc_disc_info_t cy_ble_discoveryInfo[CY_BLE_GAP_CENTRAL_COUNT +
                                                     CY_BLE_GAP_OBSERVER_COUNT] =
    {
        
    };
#endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)*/

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
    /** Default device security */
    cy_stc_ble_gap_auth_info_t cy_ble_authInfo[CY_BLE_AUTH_INFO_COUNT] =
    {
        /* Security configuration 0 */
        {
            .security = (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_1 ), 
            .bonding = CY_BLE_GAP_BONDING_NONE, 
            .ekeySize = 0x10u, 
            .authErr = CY_BLE_GAP_AUTH_ERROR_NONE, 
            .pairingProperties = 0x00u, 
        },
    };
#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) */


