Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
/*******************************************************************************
*  BLE GATT CONFIGURATION
*******************************************************************************/

#if (CY_BLE_GATT_ROLE_SERVER)
    static uint8_t cy_ble_attValues[CY_BLE_GATT_DB_ATT_VAL_COUNT] =
    {
        /* Device Name */
        (uint8_t)'F', (uint8_t)'i', (uint8_t)'n', (uint8_t)'d', (uint8_t)' ', (uint8_t)'M', (uint8_t)'e', (uint8_t)' ',
        (uint8_t)'T', (uint8_t)'a', (uint8_t)'r', (uint8_t)'g', (uint8_t)'e', (uint8_t)'t',

        /* Appearance */
        0x40u, 0x02u,

        /* Peripheral Preferred Connection Parameters */
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,

        /* Central Address Resolution */
        0x00u,

        /* Resolvable Private Address Only */
        0x00u,

        /* Service Changed */
        0x00u, 0x00u, 0x00u, 0x00u,

        /* Alert Level */
        0x00u,

        /* Manufacturer Name String */
        (uint8_t)'C', (uint8_t)'y', (uint8_t)'p', (uint8_t)'r', (uint8_t)'e', (uint8_t)'s', (uint8_t)'s', (uint8_t)' ',
        (uint8_t)'S', (uint8_t)'e', (uint8_t)'m', (uint8_t)'i', (uint8_t)'c', (uint8_t)'o', (uint8_t)'n', (uint8_t)'d',
        (uint8_t)'u', (uint8_t)'c', (uint8_t)'t', (uint8_t)'o', (uint8_t)'r', (uint8_t)' ', (uint8_t)'C', (uint8_t)'o',
        (uint8_t)'r', (uint8_t)'p', (uint8_t)'o', (uint8_t)'r', (uint8_t)'a', (uint8_t)'t', (uint8_t)'i', (uint8_t)'o',
        (uint8_t)'n',

        /* Model Number String */
        (uint8_t)'P', (uint8_t)'S', (uint8_t)'o', (uint8_t)'C', (uint8_t)' ', (uint8_t)'6', (uint8_t)' ', (uint8_t)'M',
        (uint8_t)'C', (uint8_t)'U', (uint8_t)' ', (uint8_t)'w', (uint8_t)'i', (uint8_t)'t', (uint8_t)'h', (uint8_t)' ',
        (uint8_t)'B', (uint8_t)'L', (uint8_t)'E', (uint8_t)' ', (uint8_t)'F', (uint8_t)'i', (uint8_t)'n', (uint8_t)'d',
        (uint8_t)'M', (uint8_t)'e', (uint8_t)' ', (uint8_t)'v', (uint8_t)'1', (uint8_t)'.', (uint8_t)'0', (uint8_t)'0',

        /* Serial Number String */
        

        /* Hardware Revision String */
        (uint8_t)'C', (uint8_t)'Y', (uint8_t)'8', (uint8_t)'C', (uint8_t)'K', (uint8_t)'I', (uint8_t)'T', (uint8_t)'-',
        (uint8_t)'0', (uint8_t)'6', (uint8_t)'2', (uint8_t)'-', (uint8_t)'B', (uint8_t)'L', (uint8_t)'E', (uint8_t)' ',
        (uint8_t)'P', (uint8_t)'S', (uint8_t)'o', (uint8_t)'C', (uint8_t)' ', (uint8_t)'6', (uint8_t)' ', (uint8_t)'B',
        (uint8_t)'L', (uint8_t)'E', (uint8_t)' ', (uint8_t)'P', (uint8_t)'i', (uint8_t)'o', (uint8_t)'n', (uint8_t)'e',
        (uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'K', (uint8_t)'i', (uint8_t)'t',

        /* Firmware Revision String */
        (uint8_t)'v', (uint8_t)'1', (uint8_t)'.', (uint8_t)'0', (uint8_t)'0',

        /* Software Revision String */
        

        /* System ID */
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,

        /* IEEE 11073-20601 Regulatory Certification Data List */
        

        /* PnP ID */
        0x01u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
    };

    #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
    static uint8_t cy_ble_attValuesCCCD[CY_BLE_GATT_DB_CCCD_COUNT];
    #endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */

    #if (CY_BLE_ATT_UUID_128_COUNT != 0u)
    static const uint8_t cy_ble_attUuid128[CY_BLE_ATT_UUID_128_COUNT][16u] =
    {
        
    };
    #endif /* defined(CY_BLE_ATT_UUID_128_COUNT) */

    static cy_stc_ble_gatts_att_gen_val_len_t cy_ble_attValuesLen[CY_BLE_GATT_DB_ATT_VAL_LEN_COUNT] =
    {
        { 0x000Eu, (void *)&cy_ble_attValues[0] }, /* Device Name */
        { 0x0002u, (void *)&cy_ble_attValues[14] }, /* Appearance */
        { 0x0008u, (void *)&cy_ble_attValues[16] }, /* Peripheral Preferred Connection Parameters */
        { 0x0001u, (void *)&cy_ble_attValues[24] }, /* Central Address Resolution */
        { 0x0001u, (void *)&cy_ble_attValues[25] }, /* Resolvable Private Address Only */
        { 0x0004u, (void *)&cy_ble_attValues[26] }, /* Service Changed */
        { 0x0002u, (void *)&cy_ble_attValuesCCCD[0] }, /* Client Characteristic Configuration */
        { 0x0001u, (void *)&cy_ble_attValues[30] }, /* Alert Level */
        { 0x0021u, (void *)&cy_ble_attValues[31] }, /* Manufacturer Name String */
        { 0x0020u, (void *)&cy_ble_attValues[64] }, /* Model Number String */
        { 0x0000u, (void *)&cy_ble_attValues[96] }, /* Serial Number String */
        { 0x0026u, (void *)&cy_ble_attValues[96] }, /* Hardware Revision String */
        { 0x0005u, (void *)&cy_ble_attValues[134] }, /* Firmware Revision String */
        { 0x0000u, (void *)&cy_ble_attValues[139] }, /* Software Revision String */
        { 0x0008u, (void *)&cy_ble_attValues[139] }, /* System ID */
        { 0x0000u, (void *)&cy_ble_attValues[147] }, /* IEEE 11073-20601 Regulatory Certification Data List */
        { 0x0007u, (void *)&cy_ble_attValues[147] }, /* PnP ID */
    };

    /* GATT Data Base */
    static const cy_stc_ble_gatts_db_t cy_ble_gattDB[CY_BLE_GATT_DB_INDEX_COUNT] =
    {
        { 0x0001u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Bu, {{0x1800u, NULL}}                           },
        { 0x0002u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0003u, {{0x2A00u, NULL}}                           },
        { 0x0003u, 0x2A00u /* Device Name                         */, 0x01020001u /* rd    */, 0x0003u, {{0x000Eu, (void *)&cy_ble_attValuesLen[0]}} },
        { 0x0004u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0005u, {{0x2A01u, NULL}}                           },
        { 0x0005u, 0x2A01u /* Appearance                          */, 0x01020001u /* rd    */, 0x0005u, {{0x0002u, (void *)&cy_ble_attValuesLen[1]}} },
        { 0x0006u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0007u, {{0x2A04u, NULL}}                           },
        { 0x0007u, 0x2A04u /* Peripheral Preferred Connection Par */, 0x01020001u /* rd    */, 0x0007u, {{0x0008u, (void *)&cy_ble_attValuesLen[2]}} },
        { 0x0008u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0009u, {{0x2AA6u, NULL}}                           },
        { 0x0009u, 0x2AA6u /* Central Address Resolution          */, 0x01020001u /* rd    */, 0x0009u, {{0x0001u, (void *)&cy_ble_attValuesLen[3]}} },
        { 0x000Au, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x000Bu, {{0x2AC9u, NULL}}                           },
        { 0x000Bu, 0x2AC9u /* Resolvable Private Address Only     */, 0x01020001u /* rd    */, 0x000Bu, {{0x0001u, (void *)&cy_ble_attValuesLen[4]}} },
        { 0x000Cu, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Fu, {{0x1801u, NULL}}                           },
        { 0x000Du, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x000Fu, {{0x2A05u, NULL}}                           },
        { 0x000Eu, 0x2A05u /* Service Changed                     */, 0x01200000u /* ind   */, 0x000Fu, {{0x0004u, (void *)&cy_ble_attValuesLen[5]}} },
        { 0x000Fu, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x000Fu, {{0x0002u, (void *)&cy_ble_attValuesLen[6]}} },
        { 0x0010u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0012u, {{0x1802u, NULL}}                           },
        { 0x0011u, 0x2803u /* Characteristic                      */, 0x00040001u /* wwr   */, 0x0012u, {{0x2A06u, NULL}}                           },
        { 0x0012u, 0x2A06u /* Alert Level                         */, 0x01040100u /* wwr   */, 0x0012u, {{0x0001u, (void *)&cy_ble_attValuesLen[7]}} },
        { 0x0013u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0025u, {{0x180Au, NULL}}                           },
        { 0x0014u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0015u, {{0x2A29u, NULL}}                           },
        { 0x0015u, 0x2A29u /* Manufacturer Name String            */, 0x01020001u /* rd    */, 0x0015u, {{0x0021u, (void *)&cy_ble_attValuesLen[8]}} },
        { 0x0016u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0017u, {{0x2A24u, NULL}}                           },
        { 0x0017u, 0x2A24u /* Model Number String                 */, 0x01020001u /* rd    */, 0x0017u, {{0x0020u, (void *)&cy_ble_attValuesLen[9]}} },
        { 0x0018u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0019u, {{0x2A25u, NULL}}                           },
        { 0x0019u, 0x2A25u /* Serial Number String                */, 0x01020001u /* rd    */, 0x0019u, {{0x0000u, (void *)&cy_ble_attValuesLen[10]}} },
        { 0x001Au, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Bu, {{0x2A27u, NULL}}                           },
        { 0x001Bu, 0x2A27u /* Hardware Revision String            */, 0x01020001u /* rd    */, 0x001Bu, {{0x0026u, (void *)&cy_ble_attValuesLen[11]}} },
        { 0x001Cu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Du, {{0x2A26u, NULL}}                           },
        { 0x001Du, 0x2A26u /* Firmware Revision String            */, 0x01020001u /* rd    */, 0x001Du, {{0x0005u, (void *)&cy_ble_attValuesLen[12]}} },
        { 0x001Eu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Fu, {{0x2A28u, NULL}}                           },
        { 0x001Fu, 0x2A28u /* Software Revision String            */, 0x01020001u /* rd    */, 0x001Fu, {{0x0000u, (void *)&cy_ble_attValuesLen[13]}} },
        { 0x0020u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0021u, {{0x2A23u, NULL}}                           },
        { 0x0021u, 0x2A23u /* System ID                           */, 0x01020001u /* rd    */, 0x0021u, {{0x0008u, (void *)&cy_ble_attValuesLen[14]}} },
        { 0x0022u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0023u, {{0x2A2Au, NULL}}                           },
        { 0x0023u, 0x2A2Au /* IEEE 11073-20601 Regulatory Certifi */, 0x01020001u /* rd    */, 0x0023u, {{0x0000u, (void *)&cy_ble_attValuesLen[15]}} },
        { 0x0024u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0025u, {{0x2A50u, NULL}}                           },
        { 0x0025u, 0x2A50u /* PnP ID                              */, 0x01020001u /* rd    */, 0x0025u, {{0x0007u, (void *)&cy_ble_attValuesLen[16]}} },
    };
#endif /* (CY_BLE_GATT_ROLE_SERVER) */


