Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
/*******************************************************************************
*  BLE PARAMETERS CONFIGURATIONS
*******************************************************************************/

static const cy_stc_ble_params_t cy_ble_params = {
    /** Silicon Device Address Enabled */
    .siliconDeviceAddressEn = 0x01u,

    /** Using external buffer for Prepare Write Request */
    .gattPrepareWriteExtBuffEn = CY_BLE_GATT_EN_EXT_PREP_WRITE_BUFF,

    /** The parameter to enable the configuration of the L2CAP logical channels. */
    .l2capEn = CY_BLE_L2CAP_ENABLE,

    /** The Bonding Requirement */
    .isBondingReq = CY_BLE_BONDING_REQUIREMENT,

    /** BLESS Power reflecting power level values supported by BLESS radio
     * (for advertising channel) */
    .txPowerLevelAdv = CY_BLE_LL_PWR_LVL_0_DBM,

    /** BLESS Power reflecting power level values supported by BLESS radio
     * (for connection channel) */
    .txPowerLevelConn = CY_BLE_LL_PWR_LVL_0_DBM,

    /** IO capability */
    .securityIoCapability = CY_BLE_GAP_IOCAP_NOINPUT_NOOUTPUT,

    /** L2CAP MTU Size */
    .l2capMtuSize = CY_BLE_L2CAP_MTU,

    /** L2CAP MPS Size */
    .l2capMps = CY_BLE_L2CAP_MPS,

    /** The number of L2CAP Logical channels */
    .l2capChanCount = CY_BLE_L2CAP_LOGICAL_CHANNEL_COUNT,

    /** Number of L2CAP PSMs */
    .l2capPsmCount = CY_BLE_L2CAP_PSM_COUNT,

    /** Size of prepareWriteQueue buffer */
    .gattPrepareWriteQueueSize = CY_BLE_GATT_MAX_PREPARE_BUFF_COUNT,

    /** Length of attribute value */
    .totalAttrValueLength = CY_BLE_GATT_PREPARE_LENGTH_ALIGN,

    /** The GATT Maximum attribute length */
    .gattAttrMaxLen = CY_BLE_GATT_DB_MAX_VALUE_LEN,

    /** Index count for GATT DB */
    .gattDbIndexCount  = CY_BLE_GATT_DB_INDEX_COUNT,

    /** GATT MTU Size */
    .mtuSize = CY_BLE_GATT_MTU,

    /** The GAP Role */
    .gapRole = CY_BLE_GAP_ROLE,

    /** The number of GAP Peripheral configurations */
    .gappConfCount = CY_BLE_GAP_PERIPHERAL_COUNT + CY_BLE_GAP_BROADCASTER_COUNT,

    /** The number of GAP Central configurations */
    .gapcConfCount = CY_BLE_GAP_CENTRAL_COUNT + CY_BLE_GAP_OBSERVER_COUNT,

    /** GATT Role */
    .gattRole = CY_BLE_GATT_ROLE,

    /** The number of BLE connections (client) */
    .maxClientCount = CY_BLE_GATTC_COUNT,
};


/*******************************************************************************
 *  Flash storage
 *******************************************************************************/
#if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)
#if (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES)
    /* Allocate flash storage for bond data */
    CY_SECTION(".cy_em_eeprom") CY_ALIGN(CY_FLASH_SIZEOF_ROW)
    static const uint8_t stackFlashStorage[CY_BLE_STACK_FLASH_SIZE] = { 0u };

    /* Allocate flash storage for CCCD data */
    #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
    CY_SECTION(".cy_em_eeprom") CY_ALIGN(CY_FLASH_SIZEOF_ROW)
    static const uint8_t cccdFlashStorage[CY_BLE_MAX_BONDED_DEVICES + CY_BLE_CONN_COUNT]
                                         [CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE] = { 0u };
    #endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */
#endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u) && (CY_BLE_MODE_PROFILE)
    /* RAM storage for CCCD data */
    static uint8_t cccdRamStorage[CY_BLE_CONN_COUNT][CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE];
#endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) && (CY_BLE_MODE_PROFILE)  */

    static const cy_stc_ble_flash_storage_t cy_ble_flashStorage =
    {
        /* Bond data storage */
        #if (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES)
        .stackFlashPtr   = (uint8_t *)stackFlashStorage,
        .stackFlashSize  = CY_BLE_STACK_FLASH_SIZE,
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

        /* CCCD Flash storage */
        #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES)
        .cccdFlashPtr    = (uint8_t *)cccdFlashStorage,
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

        /* CCCD RAM storage */
        #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
        .cccdRamPtr      = (uint8_t *)cccdRamStorage,
        .cccdCount       = CY_BLE_GATT_DB_CCCD_COUNT,
        #endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */
    };
#endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL) */


/*******************************************************************************
 *  Internal structures for registration and discovery services
 *******************************************************************************/
 
#if (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT)
    /* Array of registered service callbacks */
    cy_ble_event_handle_t serviceEventHandler[CY_BLE_MAX_SRVI];

    /* Structure to store registered services callbacks */
    cy_stc_ble_event_handler_t cy_ble_eventHandler =
    {
        .serviceEventHandler = serviceEventHandler,
        .maxServCount        = CY_BLE_MAX_SRVI
    };

    /* Array of discovery services */
    #if (CY_BLE_GATT_ROLE_CLIENT)
    cy_stc_ble_discovery_t cy_ble_discovery[CY_BLE_GATTC_COUNT];
    cy_stc_ble_disc_srvc_info_t cy_ble_serverInfo[CY_BLE_GATTC_COUNT][CY_BLE_SRVI_COUNT];
    #endif /* (CY_BLE_GATT_ROLE_SERVER) */

    cy_stc_ble_context_t cy_ble_contex =
    {
        /* Service callbacks */
        .eventHandlerPool = &cy_ble_eventHandler,

    #if (CY_BLE_GATT_ROLE_CLIENT)
        .discovery       = cy_ble_discovery,
        .serverInfo      = (cy_stc_ble_disc_srvc_info_t *) &cy_ble_serverInfo,
        .discServiCount  = CY_BLE_SRVI_COUNT,
    #endif /* (CY_BLE_GATT_ROLE_SERVER) */
    };
#endif /* (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT) */

#endif /* (CY_BLE_MODE_PROFILE) */


/*******************************************************************************
 *  BLE STACK configuration / RAM buffer allocation
 *******************************************************************************/

