Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
 /* Allocate RAM memory for the stack. This buffer can be reused by the application when
 * the BLE middleware is stopped. For the export mode, the buffer is allocated in a heap.
 */
#if (CY_BLE_SHARING_MODE_EXPORT)
    uint8_t *cy_ble_stackMemoryRam = NULL;
#else
    CY_ALIGN(sizeof(uint32_t)) CY_NOINIT uint8_t cy_ble_stackMemoryRam[CY_BLE_STACK_RAM_SIZE];
#endif  /* CY_BLE_SHARING_MODE_EXPORT */

/** BLE Stack parameters */
cy_stc_ble_stack_params_t stackParam =
{
    /** Memory Heap pointer */
    .memoryHeapPtr =  cy_ble_stackMemoryRam,

    /** Memory heap pointer size */
    #if (CY_BLE_MODE_PROFILE)
        .totalHeapSz =  CY_BLE_STACK_RAM_SIZE - CY_BLE_GATT_PREPARE_WRITE_BUFF_LEN,
    #else
        .totalHeapSz =  CY_BLE_STACK_RAM_SIZE,
    #endif /* (CY_BLE_MODE_PROFILE) */

    /** Configuration for the L2CAP buffer for data transmission */
    .l2capBufferPerConn =  CY_BLE_L2CAP_Q_DEPTH_PER_CONN,

    /** Max Tx payload size. */
    .dleMaxTxCapability =  CY_BLE_LL_MAX_TX_PAYLOAD_SIZE,

    /** Max Rx payload size. */
    .dleMaxRxCapability =  CY_BLE_LL_MAX_RX_PAYLOAD_SIZE,

    /** The feature set mask used to control usage of specified feature in the BLE stack */
    .featureMask = (CY_BLE_DLE_FEATURE | CY_BLE_LL_PRIVACY_FEATURE |
                    CY_BLE_SECURE_CONN_FEATURE | CY_BLE_PHY_UPDATE_FEATURE |
                    CY_BLE_STORE_BONDLIST_FEATURE | CY_BLE_STORE_RESOLVING_LIST_FEATURE |
                    CY_BLE_STORE_WHITELIST_FEATURE | CY_BLE_TX_POWER_CALIBRATION_FEATURE),

    /** The maximum number of devices that can be added to the resolve list */
    .maxResolvableDevListSize = CY_BLE_MAX_RESOLVABLE_DEVICES,

    /** The maximum number of devices that can be added to the white list */
    .maxBondedDevListSize = CY_BLE_MAX_BONDED_DEVICES,

    /** The maximum number of bonded devices to be supported by this device */
    .maxWhiteListSize = CY_BLE_MAX_WHITE_LIST_SIZE,

    /** Maximum number of BLE connections */
    .maxConnCount = CY_BLE_CONN_COUNT,

    /** Tx 5dbm mode enable */
    .tx5dbmModeEn = CY_BLE_ENABLE_TX_5DBM,

    /** Package type */
    #if defined(CY_GPIO_PIN_COUNT)
    .packageType = CY_GPIO_PACKAGE_TYPE | (CY_GPIO_PIN_COUNT << CY_BLE_PACKAGE_PIN_NUM_OFFSET),
    #else
    .packageType = CY_GPIO_PACKAGE_TYPE,
    #endif /* defined(CY_GPIO_PIN_COUNT) */    
};


/*******************************************************************************
 *  Initialize the configuration structure for BLE
 *******************************************************************************/

/** BD Address of device */
cy_stc_ble_gap_bd_addr_t cy_ble_deviceAddress =
{
    {0x00u, 0x00u, 0x00u, 0x50u, 0xA0u, 0x00u}, 0x0u
};

/** HW configuration */
cy_stc_ble_hw_config_t cy_ble_hwConfig = { NULL };

const cy_stc_ble_config_t cy_ble_config =
{
#if (CY_BLE_MODE_PROFILE)
    /* Initialize the GAPP structures */
    #if(CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
    .discoveryModeInfo = cy_ble_discoveryModeInfo,
    .gappAdvParams = cy_ble_gappAdvConfig,
    #endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */

    /* Initialize the GAPC structures */
    #if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
    .discoveryInfo = cy_ble_discoveryInfo,
    .gapcScanParams = cy_ble_gapcScanConfig,
    #endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

    /* Initialize the GATT structures */
    #if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)
    .flashStorage = &cy_ble_flashStorage,
    #endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL) */
    
    #if(CY_BLE_GATT_ROLE_SERVER)
    #if(CY_BLE_GATT_DB_CCCD_COUNT != 0u)
    .attValuesCCCD = cy_ble_attValuesCCCD,
    #endif /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */
    .gattDB = cy_ble_gattDB,
    #endif /* CY_BLE_GATT_ROLE_SERVER */

    /* Initialize the device security structure */
    #if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)
    .authInfo = cy_ble_authInfo,
    #endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL */

    /* Initialize the BLE configuration parameters structure */
    .params = &cy_ble_params,

    /** Bluetooth Device Address */
    .deviceAddress = &cy_ble_deviceAddress,

	#if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)
    /** Services initialize function */
    .ServiceInitFunc = &Cy_BLE_ServiceInit,
	#endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL */

    /** Internal structures */
	#if (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT)
    .context = &cy_ble_contex,
    #endif /* (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT) */
#endif /* (CY_BLE_MODE_PROFILE) */

    /** BLE stack configuration */
    .stackParam = &stackParam,

    /** BLE HW configuration */
    .hw = &cy_ble_hwConfig,
};


/*******************************************************************************
 *  SERVICE SPECIFIC CONFIGURATIONS
 *******************************************************************************/

#if (CY_BLE_MODE_PROFILE)

/**
 * GAP
 **/
#if (CY_BLE_GATT_ROLE_SERVER)
    /* Structure for store discovered attributes information */
    const cy_stc_ble_gaps_t cy_ble_gaps =
    {
        0x0001u, /* Handle of the GAP service */ 
        0x0003u, /* Handle of the Device Name characteristic */ 
        0x0005u, /* Handle of the Appearance characteristic */ 
        0x0007u, /* Handle of the Peripheral Preferred Connection Parameters characteristic */ 
        0x0009u, /* Handle of the Central Address Resolution characteristic */ 
        0x000Bu, /* Handle of the Resolvable Private Address Only characteristic */
    };

    /* The configuration structure for the GAP (client) */
    const cy_stc_ble_gaps_config_t cy_ble_gapsConfig =
    {
        .attrInfo = (cy_stc_ble_gaps_t *)&cy_ble_gaps,
    };
#endif /*(CY_BLE_GATT_ROLE_SERVER) */

#if (CY_BLE_GATT_ROLE_CLIENT)
    /* Structure for store discovered attributes information */
    cy_stc_ble_gapc_t cy_ble_gapc[CY_BLE_GATTC_COUNT];

