Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
    /* The configuration structure for the GATT (client) */
    const cy_stc_ble_gapc_config_t cy_ble_gapcConfig =
    {
        .attrInfo = cy_ble_gapc,
        .serviceDiscIdx = CY_BLE_SRVI_GAP,
    };
#endif /*(CY_BLE_GATT_ROLE_CLIENT) */


/**
 * GATT
 **/
#if (CY_BLE_GATT_ROLE_SERVER)
    /* Service GATT DB handles structure */
    const cy_stc_ble_gatts_t cy_ble_gatts =
    {
        0x000Cu, /* Handle of the GATT service */ 
        0x000Eu, /* Handle of the Service Changed characteristic */ 
        0x000Fu, /* Handle of the Client Characteristic Configuration descriptor */
    };

    /* The configuration structure for the GATT (client) */
    const cy_stc_ble_gatts_config_t cy_ble_gattsConfig =
    {
        .attrInfo  = (cy_stc_ble_gatts_t *)&cy_ble_gatts,
    };
#endif /*(CY_BLE_GATT_ROLE_SERVER) */

#if (CY_BLE_GATT_ROLE_CLIENT)
    /* Structure for store discovered attributes information */
    cy_stc_ble_gattc_t cy_ble_gattc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the GATT (client) */
    const cy_stc_ble_gattc_config_t cy_ble_gattcConfig =
    {
        .attrInfo = cy_ble_gattc,
        .serviceDiscIdx = CY_BLE_SRVI_GATT,
    };
#endif /* CY_BLE_GATT_ROLE_CLIENT */


/**
 * ANCS
 **/
#ifdef CY_BLE_ANCS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_ancss_t cy_ble_ancss =
    {
       
    };

    /* The configuration structure for the Apple Notification Center service (server). */
    const cy_stc_ble_ancss_config_t cy_ble_ancssConfig =
    {
        .attrInfo = &cy_ble_ancss,
    };
#endif /* CY_BLE_ANCS_SERVER */

#ifdef CY_BLE_ANCS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_ancsc_t cy_ble_ancsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Apple Notification Center service (client). */
    const cy_stc_ble_ancsc_config_t cy_ble_ancscConfig =
    {
        .attrInfo       = cy_ble_ancsc,
        .serviceDiscIdx = CY_BLE_SRVI_ANCS,
    };
#endif /* CY_BLE_ANCS_CLIENT */


/**
 * ANS
 **/
#ifdef CY_BLE_ANS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_anss_t cy_ble_anss =
    {
       
    };

    /* The configuration structure for the Alert Notification service (server). */
    const cy_stc_ble_anss_config_t cy_ble_anssConfig =
    {
        .attrInfo = &cy_ble_anss,
    };
#endif /* CY_BLE_ANS_SERVER */

#ifdef CY_BLE_ANS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_ansc_t cy_ble_ansc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Alert Notification service (client). */
    const cy_stc_ble_ansc_config_t cy_ble_anscConfig =
    {
        .attrInfo       = cy_ble_ansc,
        .serviceDiscIdx = CY_BLE_SRVI_ANS,
    };
#endif /* CY_BLE_ANS_CLIENT */


/**
 * AIOS
 **/
#ifdef CY_BLE_AIOS_SERVER

    /* Digital characteristic data */
    static const cy_stc_ble_aioss_char_t aiossCharIdx0[] =
    {
        
    };

    /* Analog characteristic data */
    static const cy_stc_ble_aioss_char_t aiossCharIdx1[] =
    {
        
    };

    /* Aggregate characteristic data */
    static const cy_stc_ble_aioss_char_t aiossCharIdx2[] =
    {
        
    };

    /* Number of AIOS characteristics instances */
    static const uint8_t cy_ble_aiossCharInstances[CY_BLE_CONFIG_AIOS_CHAR_INST_COUNT] =
    {
        
    };

    /* Service GATT DB handles structure */
    const cy_stc_ble_aioss_t cy_ble_aioss =
    {
       
    };

    /* The configuration structure for the Automation Input Output service (server). */
    const cy_stc_ble_aioss_config_t cy_ble_aiossConfig =
    {
        .attrInfo = &cy_ble_aioss,
        .charInstances  = cy_ble_aiossCharInstances,
    };
#endif /* CY_BLE_AIOS_SERVER */

#ifdef CY_BLE_AIOS_CLIENT
    /* Digital characteristic data */
    static cy_stc_ble_aiosc_char_t aioscCharIdx0[CY_BLE_GATTC_COUNT][];

    /* Analog characteristic data */
    static cy_stc_ble_aiosc_char_t aioscCharIdx1[CY_BLE_GATTC_COUNT][];

    /* Aggregate characteristic data */
    static cy_stc_ble_aiosc_char_t aioscCharIdx2[CY_BLE_GATTC_COUNT][];

    /* Number of AIOS characteristics instances */
    static const uint8_t cy_ble_aioscCharInstances[CY_BLE_CONFIG_AIOS_CHAR_INST_COUNT] =
    {
        
    };
    /* Structure for store discovered attributes information */
    const cy_stc_ble_aiosc_t cy_ble_aiosc[CY_BLE_GATTC_COUNT] =
    {
        
    };

    /* The configuration structure for the Automation Input Output service (client). */
    const cy_stc_ble_aiosc_config_t cy_ble_aioscConfig =
    {
        .attrInfo       = cy_ble_aiosc,
        .charInstances  = cy_ble_aioscCharInstances,
        .serviceDiscIdx = CY_BLE_SRVI_AIOS,
    };
#endif /* CY_BLE_AIOS_CLIENT */


/**
 * BAS
 **/
#ifdef CY_BLE_BAS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_bass_t cy_ble_bass[CY_BLE_CONFIG_BASS_SERVICE_COUNT] =
    {
        
    };

    /* The configuration structure for the Battery Service (server) */
    const cy_stc_ble_bass_config_t cy_ble_bassConfig =
    {
        .attrInfo     = cy_ble_bass,
        .serviceCount = CY_BLE_CONFIG_BASS_SERVICE_COUNT,
    };
#endif /* CY_BLE_BAS_SERVER */

#ifdef CY_BLE_BAS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_basc_t cy_ble_basc[CY_BLE_GATTC_COUNT]
                                 [CY_BLE_CONFIG_BASC_SERVICE_COUNT];

    /* The configuration structure for the Battery Service (client) */
    const cy_stc_ble_basc_config_t cy_ble_bascConfig =
    {
        .attrInfo       = (cy_stc_ble_basc_t *)cy_ble_basc,
        .serviceCount   = CY_BLE_CONFIG_BASC_SERVICE_COUNT,
        .serviceDiscIdx = CY_BLE_SRVI_BAS,
    };
#endif /* CY_BLE_BAS_CLIENT */


/**
 * BLS
 **/
#ifdef CY_BLE_BLS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_blss_t cy_ble_blss =
    {
       
    };

    /* The configuration structure for the Blood Pressure service (server). */
    const cy_stc_ble_blss_config_t cy_ble_blssConfig =
    {
        .attrInfo = &cy_ble_blss,
    };
#endif /* CY_BLE_BLS_SERVER */

#ifdef CY_BLE_BLS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_blsc_t cy_ble_blsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Blood Pressure service (client). */
    const cy_stc_ble_blsc_config_t cy_ble_blscConfig =
    {
        .attrInfo       = cy_ble_blsc,
        .serviceDiscIdx = CY_BLE_SRVI_BLS,
    };
#endif /* CY_BLE_BLS_CLIENT */


/**
 * BCS
 **/
#ifdef CY_BLE_BCS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_bcss_t cy_ble_bcss =
    {
       
