Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
    };

    /* This array contains attribute handles for the defined characteristics
     * of Custom services.
     * The array index definitions are located in the cy_cfg.h file. */
    const cy_stc_ble_customs_info_t cy_ble_customSChar[CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_COUNT] =
    {
        
    };

    /* This array contains attribute handle and pointer to characteristic
    * information array for the defined of Custom services.
    * The array index definitions are located in the cy_cfg.h file. */
    const cy_stc_ble_customs_t cy_ble_customSServ[CY_BLE_CONFIG_CUSTOMS_SERVICE_COUNT] =
    {
        
    };

    /** The configuration structure for the Custom services (server). */
    const cy_stc_ble_customs_config_t cy_ble_customsConfig =
    {
        .attrInfo = cy_ble_customSServ,
    };
#endif /* CY_BLE_CUSTOM_SERVER */

#ifdef CY_BLE_CUSTOM_CLIENT
    static uint16_t cy_ble_customCServHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    static uint16_t cy_ble_customCCharHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    static uint16_t cy_ble_customCCharEndHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    static uint16_t cy_ble_customCDescHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT][CY_BLE_GATTC_COUNT]  = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    static uint8 cy_ble_customCCharProperties[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};

    #if (CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT != 0u)
    static const cy_stc_ble_uuid128_t cy_ble_customCUuid128[CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT] =
    {
        
    };
    #endif /* (CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT != 0u) */

    #if (CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT != 0u)
    static const uint16_t cy_ble_customCUuid16[CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT] =
    {
        
    };
    #endif /* (CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT != 0u) */

    static const cy_stc_ble_customc_desc_t cy_ble_customCDesc[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT] =
    {
        
    };
    static const cy_stc_ble_customc_char_t cy_ble_customCChar[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT] =
    {
        
    };
    const cy_stc_ble_customc_t cy_ble_customCServ[CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT] =
    {
        
    };

    /** The configuration structure for the Custom services (client). */
    const cy_stc_ble_customc_config_t cy_ble_customcConfig =
    {
        .attrInfo = cy_ble_customCServ,
        .serviceCount = CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT,
        .serviceDiscIdx = CY_BLE_SRVI_CUSTOMS,
    };
#endif /* CY_BLE_CUSTOM_CLIENT */


/**
 * DIS
 **/
#ifdef CY_BLE_DIS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_diss_t cy_ble_diss =
    {
        .serviceHandle = 0x0013u, /* Handle of the DIS service */ 
        .charHandle = {
            0x0015u, /* Handle of the Manufacturer Name String characteristic */ 
            0x0017u, /* Handle of the Model Number String characteristic */ 
            0x0019u, /* Handle of the Serial Number String characteristic */ 
            0x001Bu, /* Handle of the Hardware Revision String characteristic */ 
            0x001Du, /* Handle of the Firmware Revision String characteristic */ 
            0x001Fu, /* Handle of the Software Revision String characteristic */ 
            0x0021u, /* Handle of the System ID characteristic */ 
            0x0023u, /* Handle of the IEEE 11073-20601 Regulatory Certification Data List characteristic */ 
            0x0025u, /* Handle of the PnP ID characteristic */ 
        },
    };

    /* The configuration structure for the Device Information service (server) */
    const cy_stc_ble_diss_config_t cy_ble_dissConfig =
    {
        .attrInfo = &cy_ble_diss,
    };
#endif /* CY_BLE_DIS_SERVER */

#ifdef CY_BLE_DIS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_disc_t cy_ble_disc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Device Information service  (client) */
    const cy_stc_ble_disc_config_t cy_ble_discConfig =
    {
        .attrInfo       = cy_ble_disc,
        .serviceDiscIdx = CY_BLE_SRVI_DIS,
    };
#endif /* CY_BLE_DIS_CLIENT */


/**
 * ESS
 **/
#ifdef CY_BLE_ESS_SERVER

    /* Descriptor Value Changed characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx0[] =
    {
        
    };

    /* Apparent Wind Direction characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx1[] =
    {
        
    };

    /* Apparent Wind Speed characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx2[] =
    {
        
    };

    /* Dew Point characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx3[] =
    {
        
    };

    /* Elevation characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx4[] =
    {
        
    };

    /* Gust Factor characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx5[] =
    {
        
    };

    /* Heat Index characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx6[] =
    {
        
    };

    /* Humidity characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx7[] =
    {
        
    };

    /* Irradiance characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx8[] =
    {
        
    };

    /* Pollen Concentration characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx9[] =
    {
        
    };

    /* Rainfall characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx10[] =
    {
        
    };

    /* Pressure characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx11[] =
    {
         
    };

    /* Temperature characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx12[] =
    {
         
