Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
    };

    /* True Wind Direction characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx13[] =
    {
         
    };

    /* True Wind Speed characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx14[] =
    {
         
    };

    /* UV Index characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx15[] =
    {
         
    };

    /* Wind Chill characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx16[] =
    {
         
    };

    /* Barometric Pressure Trend characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx17[] =
    {
         
    };

    /* Magnetic Declination characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx18[] =
    {
         
    };

    /* Magnetic Flux Density - 2D characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx19[] =
    {
         
    };

    /* Magnetic Flux Density - 3D characteristic data */
    static const cy_stc_ble_esss_char_t esssCharIdx20[] =
    {
         
    };

    /* Number of ESS characteristics instances */
    static const uint8_t cy_ble_esssCharInstances[CY_BLE_CONFIG_ESS_CHAR_INST_COUNT] =
    {
         
    };

    const cy_stc_ble_esss_t cy_ble_esss =
    {
        
    };

    /* The configuration structure for the Environmental Sensing service (server). */
    const cy_stc_ble_esss_config_t cy_ble_esssConfig =
    {
        .attrInfo = &cy_ble_esss,
        .charInstances  = cy_ble_esssCharInstances,
    };

#endif /* CY_BLE_ESS_SERVER */

#ifdef CY_BLE_ESS_CLIENT
    /* Descriptor Value Changed characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx0[CY_BLE_GATTC_COUNT][];

    /* Apparent Wind Direction characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx1[CY_BLE_GATTC_COUNT][];

    /* Apparent Wind Speed characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx2[CY_BLE_GATTC_COUNT][];

    /* Dew Point characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx3[CY_BLE_GATTC_COUNT][];

    /* Elevation characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx4[CY_BLE_GATTC_COUNT][];

    /* Gust Factor characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx5[CY_BLE_GATTC_COUNT][];

    /* Heat Index characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx6[CY_BLE_GATTC_COUNT][];

    /* Humidity characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx7[CY_BLE_GATTC_COUNT][];

    /* Irradiance characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx8[CY_BLE_GATTC_COUNT][];

    /* Pollen Concentration characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx9[CY_BLE_GATTC_COUNT][];

    /* Rainfall characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx10[CY_BLE_GATTC_COUNT][];

    /* Pressure characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx11[CY_BLE_GATTC_COUNT][];

    /* Temperature characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx12[CY_BLE_GATTC_COUNT][];

    /* True Wind Direction characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx13[CY_BLE_GATTC_COUNT][];

    /* True Wind Speed characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx14[CY_BLE_GATTC_COUNT][];

    /* UV Index characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx15[CY_BLE_GATTC_COUNT][];

    /* Wind Chill characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx16[CY_BLE_GATTC_COUNT][];

    /* Barometric Pressure Trend characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx17[CY_BLE_GATTC_COUNT][];

    /* Magnetic Declination characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx18[CY_BLE_GATTC_COUNT][];

    /* Magnetic Flux Density - 2D characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx19[CY_BLE_GATTC_COUNT][];

    /* Magnetic Flux Density - 3D characteristic data */
    static cy_stc_ble_essc_char_t esscCharIdx20[CY_BLE_GATTC_COUNT][];

    /* Number of ESS characteristics instances */
    static const uint8_t cy_ble_esscCharInstances[CY_BLE_CONFIG_ESS_CHAR_INST_COUNT] = {
        
    };

    /* Structure for store discovered attributes information */
    const cy_stc_ble_essc_t cy_ble_essc[CY_BLE_GATTC_COUNT] =
    {
        
    };

    /* The configuration structure for the Environmental Sensing service (client). */
    const cy_stc_ble_essc_config_t cy_ble_esscConfig =
    {
        .attrInfo       = cy_ble_essc,
        .charInstances  = cy_ble_esscCharInstances,
        .serviceDiscIdx = CY_BLE_SRVI_ESS,
    };
#endif /* CY_BLE_ESS_CLIENT */


/**
 * GLS
 **/
#ifdef CY_BLE_GLS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_glss_t cy_ble_glss =
    {
       
    };

    /* The configuration structure for the Glucose service (server). */
    const cy_stc_ble_glss_config_t cy_ble_glssConfig =
    {
        .attrInfo = &cy_ble_glss,
    };
#endif /* CY_BLE_GLS_SERVER */

#ifdef CY_BLE_GLS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_glsc_t cy_ble_glsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Glucose service (client). */
    const cy_stc_ble_glsc_config_t cy_ble_glscConfig =
    {
        .attrInfo       = cy_ble_glsc,
        .serviceDiscIdx = CY_BLE_SRVI_GLS,
    };
#endif /* CY_BLE_GLS_CLIENT */


/**
 * HIDS
 **/
#ifdef CY_BLE_HIDS_SERVER
    /* Service GATT DB handles structures */
    /* HID Server Report characteristic */
    static const cy_stc_ble_hidss_report_t cy_ble_hidssReportArray[CY_BLE_CONFIG_HIDSS_REPORT_COUNT] =
    {
        
    };

    /* HID Service attribute handles */
    const cy_stc_ble_hidss_t cy_ble_hidss[CY_BLE_CONFIG_HIDSS_SERVICE_COUNT] =
    {
        
    };

    /* The configuration structure for the HID service (server) */
    const cy_stc_ble_hidss_config_t cy_ble_hidssConfig =
    {
        .attrInfo     = cy_ble_hidss,
        .serviceCount = CY_BLE_CONFIG_HIDSS_SERVICE_COUNT,
        .reportCount  = CY_BLE_CONFIG_HIDSC_REPORT_COUNT,
    };
#endif /* CY_BLE_HIDS_SERVER */

#ifdef CY_BLE_HIDS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_hidsc_t cy_ble_hidsc[CY_BLE_GATTC_COUNT]
                                   [CY_BLE_CONFIG_HIDSC_SERVICE_COUNT];

    /** The configuration structure for the HID service (client) */
    const cy_stc_ble_hidsc_config_t cy_ble_hidscConfig =
    {
        .attrInfo       = (cy_stc_ble_hidsc_t *)cy_ble_hidsc,
        .serviceCount   = CY_BLE_CONFIG_HIDSC_SERVICE_COUNT,
        .reportCount    = CY_BLE_CONFIG_HIDSC_REPORT_COUNT,
        .serviceDiscIdx = CY_BLE_SRVI_HIDS,
    };
#endif /* CY_BLE_HIDS_CLIENT */

/**
 * HPS
 **/
#ifdef CY_BLE_HPS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_hpss_t cy_ble_hpss =
    {
       
