Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE212736_PSoC6_BLE_FindMe/GeneratedSource/cycfg_ble.c
    };

    /* The configuration structure for the HTTP Proxy service (server). */
    const cy_stc_ble_hpss_config_t cy_ble_hpssConfig =
    {
        .attrInfo = &cy_ble_hpss,
    };
#endif /* CY_BLE_HPS_SERVER */

#ifdef CY_BLE_HPS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_hpsc_t cy_ble_hpsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the HTTP Proxy service (client). */
    const cy_stc_ble_hpsc_config_t cy_ble_hpscConfig =
    {
        .attrInfo       = cy_ble_hpsc,
        .serviceDiscIdx = CY_BLE_SRVI_HPS,
    };
#endif /* CY_BLE_HPS_CLIENT */


/**
 * HRS
 **/
#ifdef CY_BLE_HRS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_hrss_t cy_ble_hrss =
    {
       
    };

    /* The configuration structure for the Heart Rate service (server). */
    const cy_stc_ble_hrss_config_t cy_ble_hrssConfig =
    {
        .attrInfo = &cy_ble_hrss,
    };
#endif /* CY_BLE_HRS_SERVER */

#ifdef CY_BLE_HRS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_hrsc_t cy_ble_hrsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Heart Rate service (client). */
    const cy_stc_ble_hrsc_config_t cy_ble_hrscConfig =
    {
        .attrInfo       = cy_ble_hrsc,
        .serviceDiscIdx = CY_BLE_SRVI_HRS,
    };
#endif /* CY_BLE_HRS_CLIENT */


/**
 * HTS
 **/
#ifdef CY_BLE_HTS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_htss_t cy_ble_htss =
    {
        
    };

    /* The configuration structure for the Health Thermometer service (server) */
    const cy_stc_ble_htss_config_t cy_ble_htssConfig =
    {
        .attrInfo = &cy_ble_htss,
    };
#endif /* CY_BLE_HTS_SERVER */

#ifdef CY_BLE_HTS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_htsc_t cy_ble_htsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Health Thermometer service (client) */
    const cy_stc_ble_htsc_config_t cy_ble_htscConfig =
    {
        .attrInfo       = cy_ble_htsc,
        .serviceDiscIdx = CY_BLE_SRVI_HTS,
    };
#endif /* CY_BLE_HTS_CLIENT */


/**
 * IAS
 **/
#ifdef CY_BLE_IAS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_iass_t cy_ble_iass =
    {
        0x0010u, /* Handle of the IAS service */ 
        0x0012u, /* Handle of the Alert Level characteristic */
    };

    /* The configuration structure for the Immediate Alert service (server) */
    const cy_stc_ble_iass_config_t cy_ble_iassConfig =
    {
        .attrInfo = &cy_ble_iass,
    };
#endif /* CY_BLE_IAS_SERVER */

#ifdef CY_BLE_IAS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_iasc_t cy_ble_iasc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Immediate Alert service (client) */
    const cy_stc_ble_iasc_config_t cy_ble_iascConfig =
    {
        .attrInfo       = cy_ble_iasc,
        .serviceDiscIdx = CY_BLE_SRVI_IAS,
    };
#endif /* CY_BLE_IAS_CLIENT */


/**
 * IPS
 **/
#ifdef CY_BLE_IPS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_ipss_t cy_ble_ipss =
    {
       
    };

    /* The configuration structure for the Indoor Positioning service (server). */
    const cy_stc_ble_ipss_config_t cy_ble_ipssConfig =
    {
        .attrInfo = &cy_ble_ipss,
    };
#endif /* CY_BLE_IPS_SERVER */

#ifdef CY_BLE_IPS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_ipsc_t cy_ble_ipsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Indoor Positioning service (client). */
    const cy_stc_ble_ipsc_config_t cy_ble_ipscConfig =
    {
        .attrInfo       = cy_ble_ipsc,
        .serviceDiscIdx = CY_BLE_SRVI_IPS,
    };
#endif /* CY_BLE_IPS_CLIENT */


/**
 * LLS
 **/
#ifdef CY_BLE_LLS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_llss_t cy_ble_llss =
    {
        
    };

    /* The configuration structure for the Link Loss service (server) */
    const cy_stc_ble_llss_config_t cy_ble_llssConfig =
    {
        .attrInfo = &cy_ble_llss,
    };
#endif /* CY_BLE_LLS_SERVER */

#ifdef CY_BLE_LLS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_llsc_t cy_ble_llsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Link Loss service (client) */
    const cy_stc_ble_llsc_config_t cy_ble_llscConfig =
    {
        .attrInfo       = cy_ble_llsc,
        .serviceDiscIdx = CY_BLE_SRVI_LLS,
    };
#endif /* CY_BLE_LLS_CLIENT */


/**
 * LNS
 **/
#ifdef CY_BLE_LNS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_lnss_t cy_ble_lnss =
    {
       
    };

    /* The configuration structure for the Location and Navigation service (server). */
    const cy_stc_ble_lnss_config_t cy_ble_lnssConfig =
    {
        .attrInfo = &cy_ble_lnss,
    };
#endif /* CY_BLE_LNS_SERVER */

#ifdef CY_BLE_LNS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_lnsc_t cy_ble_lnsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Location and Navigation service (client). */
    const cy_stc_ble_lnsc_config_t cy_ble_lnscConfig =
    {
        .attrInfo       = cy_ble_lnsc,
        .serviceDiscIdx = CY_BLE_SRVI_LNS,
    };
#endif /* CY_BLE_LNS_CLIENT */


/**
 * NDCS
 **/
#ifdef CY_BLE_NDCS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_ndcss_t cy_ble_ndcss =
    {
       
    };

    /* The configuration structure for the Next DST Change service (server). */
    const cy_stc_ble_ndcss_config_t cy_ble_ndcssConfig =
    {
        .attrInfo = &cy_ble_ndcss,
    };
#endif /* CY_BLE_NDCS_SERVER */

#ifdef CY_BLE_NDCS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_ndcsc_t cy_ble_ndcsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Next DST Change service (client). */
    const cy_stc_ble_ndcsc_config_t cy_ble_ndcscConfig =
    {
        .attrInfo       = cy_ble_ndcsc,
        .serviceDiscIdx = CY_BLE_SRVI_NDCS,
    };
#endif /* CY_BLE_NDCS_CLIENT */


/**
 * PASS
 **/
#ifdef CY_BLE_PASS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_passs_t cy_ble_passs =
    {
       
